{
  "name": "Arthur Regatieri Munhoz",
  "birthday": "19910501",
  "address": "Governador Pedro de Toledo St., 442 - Bonfim, Campinas - SP",
  "addressDetails": "Torre 1 Apto 26",
  "phone": "+55(19)97166-1346",
  "email": "arthurmunhoz@hotmail.com",
  "linkedin": "https://www.linkedin.com/in/arthurmunhoz",
  "github": "https://github.com/arthurmunhoz",
  "githubProjects": [
    {
      "name": "Rock Paper Scissors (React)",
      "link": "https://arm-rock-paper-scissor.netlify.app/"
    },
    {
      "name": "Where in the world? (React)",
      "link": "https://countries-arm.netlify.app/"
    },
    {
      "name": "Famous Movies (Android)",
      "link": "https://github.com/arthurmunhoz/FamousMovies"
    },
    {
      "name": "My Curriculum (React)",
      "link": "http://arthur-munhoz-resume.netlify.app/"
    }
  ],
  "about": {
    "title": "Hi, I'm Arthur!",
    "text-personal": "Besides a frontend developer (obvious! =P), I consider myself a very dedicated, passionate and fun guy. I love to spend time with my family and friends, and I think there is no party that beats a good Sunday barbecue.",
    "text-professional": "I'm now with over 5 year of programming experience and my love for it continues to grow as I practice, and I really found myself in the UX/UI/Frontend areas. I think a perfect day of work for me is when all these things happen: I learn, I share and I get something cool done.",
    "text-fav-tech": "Even though I've had contact with Android development for more time, the technology that I'm most passionate about is ReactJS with Typescript, which is the one I'm currently working on a daily baisis. I'm focusing on getting better each day and trying to master all React's best tools, such as Redux, Hooks, ContextAPI, Styled Components, Material UI, Router, High Order Components, and etc..."
  },
  "languages": [
    {
      "name": "Portuguese",
      "proficiency": "Native"
    },
    {
      "name": "English",
      "proficiency": "Fluent"
    },
    {
      "name": "Spanish",
      "proficiency": "Basic"
    }
  ],
  "educations": [
    {
      "institution": "Federal University of São Carlos (UFSCar)",
      "level": "Bachelor's degree in Computer Science",
      "location": "São Carlos - SP"
    }
  ],
  "courses": [
    {
      "company": "Alura",
      "name": "Bootstrap 4 - Creating a responsive landing page",
      "description": ""
    },
    {
      "company": "Alura",
      "name": "HTML5 and CSS3 - Positioning, Lists and Navigation",
      "description": ""
    },
    {
      "company": "Alura",
      "name": "React - Function Components",
      "description": ""
    },
    {
      "company": "Alura",
      "name": "React - Hooks, Contexts and good practices",
      "description": ""
    }
  ],
  "experiences": [
    {
      "company": "Kaffa Mobile",
      "companysWebsite": "https://www.kaffa.com.br",
      "startDate": "20191114",
      "endDate": null,
      "position": "Frontend Developer",
      "responsabilities": "As a member of Product's team, I act both as a UX/UI analist and frontend developer (always giving a hand when needed in the backend), and my main responsabilities are participate in early discussions/braisntorms about a new project/feature, prototype screens with mockups (low and high fidelity) and implement the frontend.\nThe technology that I've been in most contact with during this position is ReactJS + Typecript, which I fell in love with and already built some cool applications using all Reacts' best tools: Redux, Router, Hooks, Styled Components, Maps (Google Maps and Open Street Maps), ContextAPI, High Order Components and etc...",
      "tags": ["ReactJS", "Figma", "HTML", "CSS", "Kotlin", "Java"]
    },
    {
      "company": "Samsung Elet. da Amazônia",
      "companysWebsite": "https://www.samsung.com",
      "startDate": "20190504",
      "endDate": "20191107",
      "position": "UX Analist",
      "responsabilities": "As an UX Analist I could dig a little deeper in a world which is totally connected with frontend development. I got to learn from an experienced team and participate in big projets, one of which got me a trip to South Korea to make a presentation at an UX Workshop at the Samsung's Head Quarters(Yey!!). With my background in Computer Science I could play an important part when presenting and discussing the team's work (majority of times screen flows) from a more techincal point of view with the developers' team also involved in the projects.",
      "tags": ["Sketch", "Android", "Mockups"]
    },
    {
      "company": "HST Card Technology",
      "companysWebsite": "https://www.hst.com.br",
      "startDate": "20180608",
      "endDate": "20190419",
      "position": "Software Developer Jr",
      "responsabilities": "As part of the Digital team (which was mainly involved in the development of a digital wallet), my responsabilities went from planning features and it's screens for the wallet to implementing the screens and APIs.\nThe tech stack which I was involved in this position was: a lot of native Android with Java and XML (working with permissions, camera, gps, bluetooth, material design/third-party libraries/custom components for the layouts) and Figma for prototyping.",
      "tags": ["Android", "Retrofit2", "Picasso", "Custom components", "Mockups","Java", "XML", "Figma", "Android Studio"]
    },
    {
      "company": "HST Card Technology",
      "companysWebsite": "https://www.hst.com.br",
      "startDate": "20170306",
      "endDate": "20180608",
      "position": "Software Developer Intern & Trainee",
      "responsabilities": "As an Intern and member of Terminals' team, my job was to help in the development/improvement of features and drivers for ATM's and safe's applications. I've also worked with Android apps, communicating with PINPads via bluetooth.",
      "tags": ["C++", "HTML", "CSS", "Apache Ant", "Makefiles", "Android"]
    },
    {
      "company": "Walt Disney",
      "companysWebsite": "https://www.disney.com",
      "startDate": "20111114",
      "endDate": "20120220",
      "position": "Operations and Attractions",
      "responsabilities": "As a member of the Hollywood Studio's Operations and Attractions team, I was responsable for assisting the operations at some of the park's theaters and events in general (like the parades!). Some of my responsabilities involved activities from walking around the park greeting and helping guests, to help organizing the theaters prior to the shows (checking benches, emergency exits, bathrooms, etc...), make sure the guests were ok during the shows and help to clean afterwards.",
      "tags": ["Operations Assist", "Crowd Control", "Guest Greeting"]
    }
  ]
}
